BEGIN;

INSERT INTO countries (country_name) VALUES 
    ('Россия'), 
    ('Казахстан'), 
    ('Беларусь');

INSERT INTO cities (city_name, fk_country) VALUES 
    ('Москва', 1), 
    ('Санкт-Петербург', 1),  
    ('Ростов-на-Дону', 1), 
    ('Астана', 2), 
    ('Минск', 3);

INSERT INTO jobs (title, salary) VALUES 
    ('Менеджер', 45000.00), 
    ('Инженер', 55000.00), 
    ('Дизайнер', 40000.00), 
    ('Аналитик', 60000.00), 
    ('Разработчик', 70000.00);

INSERT INTO project_status (status_name) VALUES 
    ('Запущен'), 
    ('Завершен'), 
    ('Остановлен'), 
    ('Отменен');

INSERT INTO departments (name, description) VALUES 
    ('Отдел разработки', 'Ответственен за разработку продуктов'),
    ('Отдел дизайна', 'Создание интерфейсов и графики'),
    ('Отдел аналитики', 'Анализ данных и требований'),
    ('Отдел управления', 'Управление проектами и задачами');

INSERT INTO workers (first_name, last_name, middle_name, birth_date, fk_birth_city, fk_residence_city, residence_address, phone, sex, department_id, fk_job, hire_date, fk_mentor) VALUES 
    ('Иван', 'Иванов', 'Иванович', '1990-01-01', 1, 1, 'ул. Ленина, д.1', '89111234567', 'М', 1, 1, '2021-01-01', NULL),
    ('Анна', 'Петрова', 'Ивановна', '1985-05-05', 2, 1, 'ул. Советская, д.2', '89117654321', 'Ж', 2, 1, '2018-05-05', NULL),
    ('Сергей', 'Сергеев', 'Сергеевич', '1988-03-03', 3, 1, 'ул. Советская, д.3', '89113333333', 'М', 3, 1, '2019-03-03', NULL),
    ('Мария', 'Марьина', NULL, '1989-04-04', 4, 4, 'ул. Центральная, д.4', '89114444444', 'Ж', 4, 2, '2018-04-04', NULL),
    ('Андрей', 'Андреев', 'Андреевич', '1991-05-05', 5, 5, 'ул. Зеленая, д.5', '89115555555', 'М', 2, 3, '2020-05-05', 1),
    ('Ирина', 'Иринова', 'Петровна', '1983-04-16', 2, 1, 'ул. Молодежная, д.16', '89111616161', 'Ж', 1, 5, '2012-04-16', 3),
    ('Дмитрий', 'Дмитриев', 'Дмитриевич', '1982-05-17', 2, 2, 'ул. Школьная, д.17', '89111717171', 'М', 2, 2, '2011-05-17', 1),
    ('Светлана', 'Светлова', 'Алексеевна', '1981-06-18', 3, 3, 'ул. Студенческая, д.18', '89111818181', 'Ж', 3, 3, '2010-06-18', 2),
    ('Евгений', 'Евгеньев', 'Евгеньевич', '1980-07-19', 4, 4, 'ул. Профсоюзная, д.19', '89111919191', 'М', 4, 4, '2009-07-19', 3),
    ('Галина', 'Галинова', 'Васильевна', '1979-08-20', 5, 5, 'ул. Техническая, д.20', '89112020202', 'Ж', 3, 5, '2008-08-20', 1);

INSERT INTO projects (name, description, start_date, end_date, fk_status) VALUES 
    ('Проект 1', 'Описание проекта 1', '2022-02-02', NULL, 1),
    ('Проект 2', 'Описание проекта 2', '2022-03-03', '2022-09-03', 2),
    ('Проект 3', 'Описание проекта 3', '2022-04-04', NULL, 1),
    ('Проект 4', 'Описание проекта 4', '2022-05-05', '2022-11-05', 2),
    ('Проект 5', 'Описание проекта 5', '2022-06-06', '2022-12-06', 2),
    ('Проект 6', 'Описание проекта 6', '2022-07-07', NULL, 1),
    ('Проект 7', 'Описание проекта 7', '2022-08-08', NULL, 3),
    ('Проект 8', 'Описание проекта 8', '2022-09-09', '2022-12-06', 4);

INSERT INTO worker_project (fk_worker, fk_project) VALUES 
    (1, 1), (1, 2), (1, 3),
    (2, 4), (2, 5), (2, 2),
    (3, 5), (3, 6),
    (4, 1), (4, 3),
    (5, 2), (5, 4),
    (6, 4), (6, 7),
    (7, 8), (7, 6),
    (8, 7), (8, 2),
    (9, 5), (9, 3),
    (10, 4), (10, 6);

INSERT INTO department_boss (fk_department, fk_boss) VALUES
    (1, 1),
    (2, 2),
    (3, 3),
    (4, 4);

COMMIT;
